run/backwardStep_Kn1.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-6;

a 0.5;

aaa #eval{3*$a};
aa #eval{2* $a};
a10 #eval{10 * $a};


vertices
(
    (0 $a 0)
    ($aaa $a 0)
    ($aaa $aa 0)
    (0 $aa 0)

    (0 $a 1)
    ($aaa $a 1)
    ($aaa $aa 1)
    (0 $aa 1)
    
    ($a10 $a 0)
    ($a10 $aa 0)
    
    ($a10 $a 1)
    ($a10 $aa 1)
    
    ($aaa 0 0)
    ($a10 0 0)

    ($aaa 0 1)
    ($a10 0 1) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 24 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (150 24 1) simpleGrading (1 1 1)
    hex (12 13 8 1 14 15 10 5) (150 24 1) simpleGrading (1 1 1)    
);

edges
(
);

boundary
(
    
    INLET
    {
        type patch;
        faces
        (
            (0 3 7 4)            
        );
    }
    OUTLET
    {
        type patch;
        faces
        (
            (8 10 11 9)
            (13 15 10 8)
        );
    }

    WALL
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
            (0 4 5 1)
            (12 1 5 14)
            (12 14 15 13)            
        );
    }
        
);

mergePatchPairs
(
);

// ************************************************************************* //